Stray8/RFID/Software/PSDK_RFID-small_payload/sample/platform/rtos_freertos/stm32f4_eval/application/main.c
/**
 ********************************************************************
 * @file    main.c
 * @version V2.0.0
 * @date    2019/8/23
 * @brief
 *
 * @copyright (c) 2018-2019 DJI. All rights reserved.
 *
 * All information contained herein is, and remains, the property of DJI.
 * The intellectual and technical concepts contained herein are proprietary
 * to DJI and may be covered by U.S. and foreign patents, patents in process,
 * and protected by trade secret or copyright law.  Dissemination of this
 * information, including but not limited to data and other proprietary
 * material(s) incorporated within the information, in any form, is strictly
 * prohibited without the express written consent of DJI.
 *
 * If you receive this source code without DJI’s authorization, you may not
 * further disseminate the information, and you must immediately remove the
 * source code and notify DJI of its removal. DJI reserves the right to pursue
 * legal actions against you for any loss(es) or damage(s) caused by your
 * failure to do so.
 *
 ********************************************************************* */






/*-------------Connect Configuration-----------------
	USART1 	TO PC   	115200		[TX A9|RX A10]
	USART3 	TO M300		460800		[TX B10|RX B11]		PS 临时测试demo连接(橙色杜邦线是TX，连接开发板的RX)
	UART4  	TO RFID		115200		[TX C10|RX C11]			
----------------------------------------------------*/



/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "application.h"
#include "FreeRTOS.h"
#include "task.h"
#include "psdk_platform.h"


/* Private constants ---------------------------------------------------------*/
#define USER_START_TASK_STACK_SIZE          512
#define USER_START_TASK_PRIORITY            0
#define USER_RUN_INDICATE_TASK_STACK_SIZE   256
#define USER_RUN_INDICATE_TASK_PRIORITY     0


/* Private types -------------------------------------------------------------*/


/* Private values -------------------------------------------------------------*/
static TaskHandle_t startTask;
static TaskHandle_t runIndicateTask;

/* Private functions declaration ---------------------------------------------*/
static void SystemClock_Config(void);

/* Exported functions definition ---------------------------------------------*/
#ifndef __CC_ARM
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-noreturn"
#pragma GCC diagnostic ignored "-Wreturn-type"
#endif

int main(void)
{
    /* STM32F4xx HAL library initialization:
         - Configure the Flash prefetch, instruction and Data caches
         - Configure the Systick to generate an interrupt each 1 msec
         - Set NVIC Group Priority to 4
         - Global MSP (MCU Support Package) initialization
       */
    HAL_Init();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

    /* Create start task */
//    xTaskCreate((TaskFunction_t) test_StartTask, 
//				"start_task", 
//				USER_START_TASK_STACK_SIZE,
//                NULL, 
//				USER_START_TASK_PRIORITY, 
//				startTask);


	/* Create start task */
    xTaskCreate((TaskFunction_t) PsdkUser_StartTask, 
				"start_task", 
				USER_START_TASK_STACK_SIZE,
                NULL, 
				USER_START_TASK_PRIORITY, 
				startTask);
	
    /* Create runIndicate task */
//    xTaskCreate((TaskFunction_t) PsdkUser_RunIndicateTask, 	
//				"run_indicate_task", 
//				USER_RUN_INDICATE_TASK_STACK_SIZE,
//				NULL, 
//				USER_RUN_INDICATE_TASK_PRIORITY, 
//				runIndicateTask);

    /* Start scheduler */
    vTaskStartScheduler();

    /*Taken by the scheduler */
    for (;;);
}

#ifndef __CC_ARM
#pragma GCC diagnostic pop
#endif

/* Private functions definition-----------------------------------------------*/
/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow :
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 168000000
  *            HCLK(Hz)                       = 168000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = HSE_VALUE
  *            PLL_M                          = HSE_VALUE/1000000
  *            PLL_N                          = 336
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
	uint32_t temp = HSE_VALUE;
	HAL_StatusTypeDef ret = HAL_OK;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;
    RCC_OscInitTypeDef RCC_OscInitStruct;

    /* Enable Power Control clock */
    __HAL_RCC_PWR_CLK_ENABLE();

    /* The voltage scaling allows optimizing the power consumption when the device is
       clocked below the maximum system frequency, to update the voltage scaling value
       regarding system frequency refer to product datasheet.  */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /* Enable HSE Oscillator and activate PLL with HSE as source */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8000000 / 1000000;
    RCC_OscInitStruct.PLL.PLLN = 336;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 7;
    ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);

	if(ret!=HAL_OK) while(1);
	
    /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
       clocks dividers */
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 |
                                   RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);

	if(ret!=HAL_OK) while(1);
	
    /* STM32F405x/407x/415x/417x Revision Z devices: prefetch is supported  */
    if (HAL_GetREVID() == 0x1001) {
        /* Enable the Flash prefetch */
        __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
    }
}

/****************** (C) COPYRIGHT DJI Innovations *****END OF FILE****/
